ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.c
  /* PWR clock enabled.*/
  rccEnablePWRInterface(false);

  /* Static PWR configurations.*/
#if defined(STM32G0B0xx) && HAL_USE_USB
  /* Special case, CR2 is handled as static. Note: retaining set bits in
     CR2 is required.*/
  PWR->CR2  |= PWR_CR2_USV;
#endif
  PWR->CR3   = STM32_PWR_CR3;
  PWR->CR4   = STM32_PWR_CR4;
  PWR->PUCRA = STM32_PWR_PUCRA;
  PWR->PDCRA = STM32_PWR_PDCRA;
  PWR->PUCRB = STM32_PWR_PUCRB;
  PWR->PDCRB = STM32_PWR_PDCRB;
  PWR->PUCRC = STM32_PWR_PUCRC;
  PWR->PDCRC = STM32_PWR_PDCRC;
#if STM32_HAS_GPIOD
  PWR->PUCRD = STM32_PWR_PUCRD;
  PWR->PDCRD = STM32_PWR_PDCRD;
#endif
#if STM32_HAS_GPIOE
  PWR->PUCRE = STM32_PWR_PUCRE;
  PWR->PDCRE = STM32_PWR_PDCRE;
#endif
#if STM32_HAS_GPIOF
  PWR->PUCRF = STM32_PWR_PUCRF;
  PWR->PDCRF = STM32_PWR_PDCRF;
#endif
#if STM32_HAS_GPIOG
  PWR->PUCRG = STM32_PWR_PUCRG;
  PWR->PDCRG = STM32_PWR_PDCRG;
#endif
#if STM32_HAS_GPIOH
  PWR->PUCRH = STM32_PWR_PUCRH;
  PWR->PDCRH = STM32_PWR_PDCRH;
#endif
#if STM32_HAS_GPIOI
  PWR->PUCRI = STM32_PWR_PUCRI;
  PWR->PDCRI = STM32_PWR_PDCRI;
#endif
}

/**
 * @brief   Initializes static muxes and dividers.
 */
__STATIC_INLINE void hal_lld_set_static_clocks(void) {

  /* Clock-related settings (dividers, MCO etc).*/
#if STM32_RCC_HAS_MCO2 == TRUE
  RCC->CFGR = STM32_MCOPRE | STM32_MCOSEL | STM32_MCO2PRE | STM32_MCO2SEL |
              STM32_PPRE   | STM32_HPRE;
#else
  RCC->CFGR = STM32_MCOPRE | STM32_MCOSEL |
              STM32_PPRE   | STM32_HPRE;
#endif

  /* Set HSISYS divisor.*/
  RCC->CR = (RCC->CR & ~STM32_HSIDIV_MASK) | STM32_HSIDIV;

#if STM32_RCC_HAS_CCIPR2
  /* CCIPR register initialization.*/
  RCC->CCIPR =  STM32_ADCSEL    | STM32_RNGDIV     | STM32_RNGSEL    |
                STM32_TIM15SEL  | STM32_TIM1SEL    | STM32_LPTIM2SEL |
                STM32_LPTIM1SEL | STM32_I2C2SEL    | STM32_I2C1SEL   |
                STM32_CECSEL    | STM32_USART3SEL  | STM32_USART2SEL |
                STM32_USART1SEL | STM32_LPUART2SEL | STM32_LPUART1SEL;

  /* CCIPR2 register initialization.*/
  RCC->CCIPR2 = STM32_USBSEL    | STM32_FDCANSEL   | STM32_I2S2SEL   |
                STM32_I2S1SEL;

#else
  /* CCIPR register initialization.*/
  RCC->CCIPR =  STM32_ADCSEL    | STM32_RNGDIV     | STM32_RNGSEL    |
                STM32_TIM15SEL  | STM32_TIM1SEL    | STM32_LPTIM2SEL |
                STM32_LPTIM1SEL | STM32_I2S1SEL    | STM32_I2C1SEL   |
                STM32_CECSEL    | STM32_USART3SEL  | STM32_USART2SEL |
                STM32_USART1SEL | STM32_LPUART2SEL | STM32_LPUART1SEL;
#endif
}

/**
 * @brief   Switches to a different clock configuration.
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @return              The clock switch result.
 * @retval false        if the clock switch succeeded
 * @retval true         if the clock switch failed
 *
 * @notapi
 */
static bool hal_lld_clock_configure(const halclkcfg_t *ccp) {
  uint32_t wtmask;
  uint32_t cr;
  uint32_t acr;

  /* Setting flash ACR to the safest value while the clock tree is
     reconfigured. */
  acr = FLASH_ACR_ICEN;
#if defined(FLASH_ACR_PRFTEN)
  acr |= FLASH_ACR_PRFTEN;
#endif
#if defined(FLASH_ACR_DBG_SWEN)
  acr |= FLASH_ACR_DBG_SWEN;
#endif
  acr |= (2U << FLASH_ACR_LATENCY_Pos);
  flash_set_acr(acr);

  /* Disabling low power run mode if activated, not touching current
     VOS range yet.*/
  halRegClear32X(&PWR->CR1, PWR_CR1_LPR, false);
  if (halRegWaitAllClear32X(&PWR->SR2, PWR_SR2_REGLPF,
                            STM32_REGULATORS_TRANSITION_TIME, NULL)) {
    return true;
  }

  /* Making sure HSI16 is activated and in use.*/
  halRegWrite32X(&RCC->CR, STM32_RCC_CR_RESET, true);
  if (halRegWaitAllSet32X(&RCC->CR, RCC_CR_HSIRDY,
                          STM32_HSI_STARTUP_TIME,
                          NULL)) {
    return true;
  }

  halRegWrite32X(&RCC->CFGR, STM32_RCC_CFGR_RESET, true);
  if (halRegWaitMatch32X(&RCC->CFGR,
                         RCC_CFGR_SWS_Msk, RCC_CFGR_SWS_HSI,
                         STM32_SYSCLK_SWITCH_TIME,
                         NULL)) {
    return true;
  }

  /* Resetting clocks-related settings.*/
  halRegWrite32X(&RCC->CR, STM32_RCC_CR_RESET, true);
  halRegWrite32X(&RCC->PLLCFGR, 0U, true);

  /* Post-reset voltage scaling enforcing.*/
  halRegWrite32X(&PWR->CR1, STM32_PWR_CR1_RESET, true);
  if (halRegWaitAllClear32X(&PWR->SR2, PWR_SR2_VOSF,
                            STM32_REGULATORS_TRANSITION_TIME, NULL)) {
    return true;
  }

  /* Enabling all required oscillators at same time, HSI enforced active,
     PLL not enabled yet.*/
  cr = ccp->rcc_cr | RCC_CR_HSION;
#if defined(STM32_HSE_BYPASS)
  if ((ccp->rcc_cr & RCC_CR_HSEON) != 0U) {
    cr |= RCC_CR_HSEBYP;
  }
#endif

  /* Enabling all required oscillators except PLL.*/
  halRegWrite32X(&RCC->CR, cr & ~RCC_CR_PLLON, true);

  /* Adding to the "wait mask" the status bits of enabled oscillators.*/
  wtmask = RCC_CR_HSIRDY;
  if ((cr & RCC_CR_HSEON) != 0U) {
    wtmask |= RCC_CR_HSERDY;
  }
#if STM32_RCC_HAS_HSI48
  if ((cr & RCC_CR_HSI48ON) != 0U) {
    wtmask |= RCC_CR_HSI48RDY;
  }
#endif

  if (halRegWaitAllSet32X(&RCC->CR, wtmask,
                          STM32_OSCILLATORS_STARTUP_TIME,
                          NULL)) {
    return true;
  }

  /* Final programmable voltage scaling configuration. */
  halRegWrite32X(&PWR->CR1, ccp->pwr_cr1, true);
#if STM32_PWR_HAS_CR2 == TRUE
  halRegWrite32X(&PWR->CR2, ccp->pwr_cr2, true);
#endif

  if (halRegWaitAllClear32X(&PWR->SR2, PWR_SR2_VOSF,
                            STM32_REGULATORS_TRANSITION_TIME,
                            NULL)) {
    return true;
  }

  /* Waiting for the correct regulator state.*/
  if ((ccp->pwr_cr1 & PWR_CR1_LPR) == 0U) {
    /* Main mode selected.*/
    if (halRegWaitAllClear32X(&PWR->SR2, PWR_SR2_REGLPF,
                              STM32_REGULATORS_TRANSITION_TIME,
                              NULL)) {
      return true;
    }
  }
  else {
    /* Low power mode selected.*/
    if (halRegWaitAllSet32X(&PWR->SR2, PWR_SR2_REGLPF,
                            STM32_REGULATORS_TRANSITION_TIME,
                            NULL)) {
      return true;
    }
  }

