ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.c
  /* Enabling also PLLs if required by the configuration else skipping.*/
  if ((ccp->rcc_cr & RCC_CR_PLLON) != 0U) {
    halRegWrite32X(&RCC->PLLCFGR, ccp->rcc_pllcfgr, true);
    halRegWrite32X(&RCC->CR, cr | RCC_CR_PLLON, true);
    if (halRegWaitAllSet32X(&RCC->CR, RCC_CR_PLLRDY,
                            STM32_PLL_STARTUP_TIME,
                            NULL)) {
      return true;
    }
  }

  /* Final RCC CFGR settings (prescalers, MCO, etc).*/
  halRegWrite32X(&RCC->CFGR, ccp->rcc_cfgr, true);

  /* Final flash ACR settings according to the target configuration.*/
  flash_set_acr(ccp->flash_acr);

  /* Switching to the final clock source.*/
  if (halRegWaitMatch32X(&RCC->CFGR,
                         RCC_CFGR_SWS_Msk,
                         (ccp->rcc_cfgr & RCC_CFGR_SW_Msk) << RCC_CFGR_SWS_Pos,
                         STM32_SYSCLK_SWITCH_TIME,
                         NULL)) {
    return true;
  }

  /* Final RCC_CR value, HSI could go off at this point if it is not part
     of the mask.*/
#if defined(STM32_HSE_BYPASS)
  if ((ccp->rcc_cr & RCC_CR_HSEON) != 0U) {
    halRegWrite32X(&RCC->CR, ccp->rcc_cr | RCC_CR_HSEBYP, true);
  }
  else {
    halRegWrite32X(&RCC->CR, ccp->rcc_cr, true);
  }
#else
  halRegWrite32X(&RCC->CR, ccp->rcc_cr, true);
#endif

  return false;
}

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Recalculates the clock tree frequencies.
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @return              The frequency calculation result.
 * @retval false        if the clock settings look valid
 * @retval true         if the clock settings look invalid
 *
 * @notapi
 */
static bool hal_lld_clock_check_tree(const halclkcfg_t *ccp) {
  static const uint32_t hprediv[16] = {1U, 1U, 1U, 1U, 1U, 1U, 1U, 1U,
                                       2U, 4U, 8U, 16U, 64U, 128U, 256U, 512U};
  static const uint32_t pprediv[16] = {1U, 1U, 1U, 1U, 2U, 4U, 8U, 16U};
  const system_limits_t *slp;
  halfreq_t hsi16clk = 0U, hseclk = 0U, pllselclk, hsisysclk;
  halfreq_t pllpclk = 0U, pllqclk = 0U, pllrclk = 0U;
  halfreq_t sysclk, hclk, pclk, pclktim, mcoclk;
#if STM32_RCC_HAS_MCO2 == TRUE
  halfreq_t mco2clk;
#endif
  uint32_t mcodiv, flashws, hsidiv;

  /* System limits based on desired VOS settings.*/
  if ((ccp->pwr_cr1 & PWR_CR1_VOS_Msk) == PWR_CR1_VOS_1) {
    slp = &vos_range2;
  }
  else if ((ccp->pwr_cr1 & PWR_CR1_VOS_Msk) == PWR_CR1_VOS_0) {
    slp = &vos_range1;
  }
  else {
    return true;
  }

  /* HSI16 clock.*/
  if ((ccp->rcc_cr & RCC_CR_HSION) != 0U) {
    hsi16clk = STM32_HSI16CLK;
  }

  /* HSISYS clock.*/
  hsidiv = 1U << ((ccp->rcc_cr & RCC_CR_HSIDIV_Msk) >> RCC_CR_HSIDIV_Pos);
  hsisysclk = hsi16clk / hsidiv;

  /* HSE clock.*/
  if ((ccp->rcc_cr & RCC_CR_HSEON) != 0U) {
    hseclk = STM32_HSECLK;
  }

  /* PLL MUX clock.*/
  switch (ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLSRC_Msk) {
  case RCC_PLLCFGR_PLLSRC_HSI:
    pllselclk = hsi16clk;
    break;
  case RCC_PLLCFGR_PLLSRC_HSE:
    pllselclk = hseclk;
    break;
  default:
    pllselclk = 0U;
  }

  /* PLL outputs.*/
  if ((ccp->rcc_cr & RCC_CR_PLLON) != 0U) {
    uint32_t pllmdiv, pllndiv, pllpdiv, pllqdiv, pllrdiv;
    halfreq_t pllvcoclk;

    /* PLL M divider.*/
    pllmdiv = ((ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLM_Msk) >> RCC_PLLCFGR_PLLM_Pos) + 1U;

    /* PLL N divider.*/
    pllndiv = (ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLN_Msk) >> RCC_PLLCFGR_PLLN_Pos;
    if (pllndiv < 8) {
      return true;
    }

    /* PLL VCO frequency.*/
    pllvcoclk = (pllselclk / (halfreq_t)pllmdiv) * (halfreq_t)pllndiv;

    if ((pllvcoclk < slp->pllvco_min) || (pllvcoclk > slp->pllvco_max)) {
      return true;
    }

    /* PLL P output frequency.*/
    pllpdiv = 1U + ((ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLP_Msk) >> RCC_PLLCFGR_PLLP_Pos);
    if ((ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLPEN) != 0U) {
      pllpclk = pllvcoclk / pllpdiv;

      if ((pllpclk < slp->pllp_min) || (pllpclk > slp->pllp_max)) {
        return true;
      }
    }

    /* PLL Q output frequency.*/
    pllqdiv = 1U + ((ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLQ_Msk) >> RCC_PLLCFGR_PLLQ_Pos);
    if ((ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLQEN) != 0U) {
      pllqclk = pllvcoclk / pllqdiv;

      if ((pllqclk < slp->pllq_min) || (pllqclk > slp->pllq_max)) {
        return true;
      }
    }

    /* PLL R output frequency.*/
    pllrdiv = 1U + ((ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLR_Msk) >> RCC_PLLCFGR_PLLR_Pos);
    if ((ccp->rcc_pllcfgr & RCC_PLLCFGR_PLLREN) != 0U) {
      pllrclk = pllvcoclk / pllrdiv;

      if ((pllrclk < slp->pllr_min) || (pllrclk > slp->pllr_max)) {
        return true;
      }
    }
  }

  /* SYSCLK frequency.*/
  switch (ccp->rcc_cfgr & RCC_CFGR_SW_Msk) {
  case RCC_CFGR_SW_HSI:
    sysclk = hsisysclk;
    break;
  case RCC_CFGR_SW_HSE:
    sysclk = hseclk;
    break;
  case RCC_CFGR_SW_PLL:
    sysclk = pllrclk;
    break;
  case RCC_CFGR_SW_LSI:
    sysclk = STM32_LSICLK;
    break;
  case RCC_CFGR_SW_LSE:
    sysclk = STM32_LSECLK;
    break;
  default:
    sysclk = 0U;
  }

  if ((sysclk == 0U) || (sysclk > slp->sysclk_max)) {
    return true;
  }

  /* HCLK frequency.*/
  hclk = sysclk / hprediv[(ccp->rcc_cfgr & RCC_CFGR_HPRE_Msk) >> RCC_CFGR_HPRE_Pos];

  /* PPRE frequency.*/
  pclk = hclk / pprediv[(ccp->rcc_cfgr & RCC_CFGR_PPRE_Msk) >> RCC_CFGR_PPRE_Pos];
  if ((ccp->rcc_cfgr & RCC_CFGR_PPRE_Msk) < RCC_CFGR_PPRE_DIV2) {
    pclktim = pclk;
  }
  else {
    pclktim = pclk * 2U;
  }

  /* MCO clock.*/
  switch (ccp->rcc_cfgr & RCC_CFGR_MCOSEL_Msk) {
  case STM32_MCOSEL_NOCLOCK:
    mcoclk = 0U;
    break;
  case STM32_MCOSEL_SYSCLK:
    mcoclk = sysclk;
    break;
  case STM32_MCOSEL_HSI16:
    mcoclk = hsi16clk;
    break;
#if STM32_RCC_HAS_HSI48
  case STM32_MCOSEL_HSI48:
    mcoclk = STM32_HSI48CLK;
    break;
#endif
  case STM32_MCOSEL_HSE:
    mcoclk = hseclk;
    break;
  case STM32_MCOSEL_PLLRCLK:
    mcoclk = pllrclk;
    break;
  case STM32_MCOSEL_LSI:
    mcoclk = STM32_LSICLK;
    break;
  case STM32_MCOSEL_LSE:
    mcoclk = STM32_LSECLK;
    break;
#if STM32_RCC_HAS_MCOSEL_EXT == TRUE
  case STM32_MCOSEL_PLLPCLK:
    mcoclk = pllpclk;
    break;
  case STM32_MCOSEL_PLLQCLK:
    mcoclk = pllqclk;
    break;
  case STM32_MCOSEL_RTCCLK:
    mcoclk = STM32_RTCCLK;
    break;
#endif
  default:
    mcoclk = 0U;
  }
  mcodiv = 1U << ((ccp->rcc_cfgr & RCC_CFGR_MCOPRE_Msk) >> RCC_CFGR_MCOPRE_Pos);
#if STM32_RCC_HAS_MCOPRE_EXT == TRUE
  if (mcodiv > 1024U) {
#else
  if (mcodiv > 128U) {
#endif
    return true;
  }
  mcoclk /= mcodiv;

#if STM32_RCC_HAS_MCO2 == TRUE
  /* MCO2 clock.*/
  switch (ccp->rcc_cfgr & RCC_CFGR_MCO2SEL_Msk) {
  case STM32_MCO2SEL_NOCLOCK:
    mco2clk = 0U;
    break;
  case STM32_MCO2SEL_SYSCLK:
    mco2clk = sysclk;
    break;
  case STM32_MCO2SEL_HSI16:
    mco2clk = hsi16clk;
    break;
#if STM32_RCC_HAS_HSI48
  case STM32_MCO2SEL_HSI48:
    mco2clk = STM32_HSI48CLK;
    break;
#endif
  case STM32_MCO2SEL_HSE:
    mco2clk = hseclk;
    break;
  case STM32_MCO2SEL_PLLRCLK:
    mco2clk = pllrclk;
    break;
  case STM32_MCO2SEL_LSI:
    mco2clk = STM32_LSICLK;
    break;
  case STM32_MCO2SEL_LSE:
    mco2clk = STM32_LSECLK;
    break;
  case STM32_MCO2SEL_PLLPCLK:
    mco2clk = pllpclk;
    break;
  case STM32_MCO2SEL_PLLQCLK:
    mco2clk = pllqclk;
    break;
  case STM32_MCO2SEL_RTCCLK:
    mco2clk = STM32_RTCCLK;
    break;
  default:
    mco2clk = 0U;
  }
  mcodiv = 1U << ((ccp->rcc_cfgr & RCC_CFGR_MCO2PRE_Msk) >> RCC_CFGR_MCO2PRE_Pos);
#if STM32_RCC_HAS_MCOPRE_EXT == TRUE
  if (mcodiv > 1024U) {
#else
  if (mcodiv > 128U) {
#endif
    return true;
  }
  mco2clk /= mcodiv;
#endif

  /* Flash settings.*/
  flashws = ((ccp->flash_acr & FLASH_ACR_LATENCY_Msk) >> FLASH_ACR_LATENCY_Pos);
  if (flashws >= STM32_WS_THRESHOLDS) {
    return true;
  }
  if (hclk > slp->flash_thresholds[flashws]) {
    return true;
  }

  /* Writing out results.*/
  clock_points[CLK_SYSCLK]    = sysclk;
  clock_points[CLK_HSISYSCLK] = hsisysclk;
  clock_points[CLK_PLLPCLK]   = pllpclk;
  clock_points[CLK_PLLQCLK]   = pllqclk;
  clock_points[CLK_PLLRCLK]   = pllrclk;
  clock_points[CLK_HCLK]      = hclk;
  clock_points[CLK_PCLK]      = pclk;
  clock_points[CLK_PCLKTIM]   = pclktim;
  clock_points[CLK_MCO]       = mcoclk;
#if STM32_RCC_HAS_MCO2 == TRUE
  clock_points[CLK_MCO2]      = mco2clk;
#endif

