ArduPilot/ardupilot/modules/ChibiOS/os/hal/ports/STM32/STM32G0xx/hal_lld.c
  return false;
}

#if 0
/**
 * @brief   Configures clock switch-only settings.
 * @note    This is a fast reconfiguration, clock sources settings are not
 *          touched, only switches and dividers are reprogrammed.
 *
 * @param[in] cwp       pointer to clock a @p halclkswc_t structure
 * @return              The clock configuration result.
 * @retval false        if the clock switch succeeded
 * @retval true         if the clock switch failed
 *
 * @notapi
 */
static bool hal_lld_clock_raw_switch(const halclkswc_t *cwp) {

  /* PWR modes.*/
  PWR->CR1 = (PWR->CR1 & ~STM32_PWR_CR1_SAFE_ONLY_MASK) |
             (cwp->pwr_cr1 & STM32_PWR_CR1_SAFE_ONLY_MASK);

  /* Flash ACR settings.*/
  flash_set_acr(cwp->flash_acr);

  /* Switching to the final clock source.*/
  RCC->CFGR = cwp->rcc_cfgr;
  while ((RCC->CFGR & RCC_CFGR_SWS) != ((cwp->rcc_cfgr & RCC_CFGR_SW_Msk) << RCC_CFGR_SWS_Pos)) {
    /* Waiting for clock switch.*/
  }

  return false;
}
#endif
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/*===========================================================================*/
/* Driver interrupt handlers.                                                */
/*===========================================================================*/

/*===========================================================================*/
/* Driver exported functions.                                                */
/*===========================================================================*/

/**
 * @brief   Low level HAL driver initialization.
 *
 * @notapi
 */
void hal_lld_init(void) {

  /* DMA subsystems initialization.*/
#if defined(STM32_DMA_REQUIRED)
  dmaInit();
#endif

  /* NVIC initialization.*/
  nvicInit();

  /* IRQ subsystem initialization.*/
  irqInit();
}

/**
 * @brief   STM32G0xx clocks and PLL initialization.
 * @note    All the involved constants come from the file @p board.h.
 * @note    This function should be invoked just after the system reset.
 *
 * @special
 */
void stm32_clock_init(void) {
  int32_t div;

  /* Enabling TIM17 for timeout handling.*/
  rccResetTIM17();
  rccEnableTIM17(false);
  /* Clamp divider to avoid underflow on low TIM17CLK values. */
#if defined(STM32_TIM17CLK)
  div = ((int32_t)STM32_TIM17CLK / 1000000) - 1;
#else
  div = ((int32_t)STM32_TIMCLK2 / 1000000) - 1;
#endif
  if (div < 0) {
    div = 0;
  }
  halRegWrite32X(&TIM17->PSC, (uint32_t)div, true);
//  halRegWrite32X(&TIM17->ARR, 0xFFFFU, true);
  halRegWrite32X(&TIM17->EGR, TIM_EGR_UG, false);
  halRegWrite32X(&TIM17->CR1, TIM_CR1_CEN, true);

#if !STM32_NO_INIT
  /* Reset of all peripherals.*/
  rccResetAHB(~0);
  rccResetAPBR1(~0);
  rccResetAPBR2(~0);

  /* SYSCFG clock enabled here because it is a multi-functional unit shared
     among multiple drivers.*/
  rccEnableAPBR2(RCC_APBENR2_SYSCFGEN, false);

#if defined(RCC_APBENR1_DBGEN)
  /* Enable DBG clock. Required for TIM freeze to be enabled.*/
  rccEnableAPBR1(RCC_APBENR1_DBGEN, true);
#endif

#if defined(HAL_USE_RTC) && defined(RCC_APBENR1_RTCAPBEN)
  rccEnableAPBR1(RCC_APBENR1_RTCAPBEN, true);
#endif

  /* Static PWR configurations.*/
  hal_lld_set_static_pwr();

  /* Backup domain made accessible.*/
  PWR->CR1 |= PWR_CR1_DBP;

  /* Backup domain reset.*/
  bd_reset();

  /* Static oscillators setup.*/
  lse_init();
  lsi_init();

  /* Static clocks setup.*/
  hal_lld_set_static_clocks();

  /* Selecting the default clock/power/flash configuration.*/
  halSftFailOnError(hal_lld_clock_configure(&hal_clkcfg_default), "clkinit");

  /* Backup domain initializations.*/
  bd_init();
#endif /* STM32_NO_INIT */
}

#if defined(HAL_LLD_USE_CLOCK_MANAGEMENT) || defined(__DOXYGEN__)
/**
 * @brief   Switches to a different clock configuration
 *
 * @param[in] ccp       pointer to clock a @p halclkcfg_t structure
 * @return              The clock switch result.
 * @retval false        if the clock switch succeeded
 * @retval true         if the clock switch failed
 *
 * @notapi
 */
bool hal_lld_clock_switch_mode(const halclkcfg_t *ccp) {
  int32_t div;

  if (hal_lld_clock_check_tree(ccp)) {
    return true;
  }

  if (hal_lld_clock_configure(ccp)) {
    return true;
  }

  /* Updating timeout counter clock, contemplating the case where the clock
     source frequency becomes lower than 1MHz.*/
#if defined(STM32_TIM17CLK)
  div = ((int32_t)STM32_TIM17CLK / 1000000) - 1;
#else
  div = ((int32_t)hal_lld_get_clock_point(CLK_PCLKTIM) / 1000000) - 1;
#endif
  if (div < 0) {
    div = 0;
  }
  halRegWrite32X(&TIM17->PSC, (uint32_t)div, true);
  halRegWrite32X(&TIM17->EGR, TIM_EGR_UG, false);

  /* Updating the CMSIS variable.*/
  SystemCoreClock = hal_lld_get_clock_point(CLK_HCLK);

  return false;
}

/**
 * @brief   Returns the frequency of a clock point in Hz.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
halfreq_t hal_lld_get_clock_point(halclkpt_t clkpt) {

  osalDbgAssert(clkpt < CLK_ARRAY_SIZE, "invalid clock point");

  return clock_points[clkpt];
}
#endif /* defined(HAL_LLD_USE_CLOCK_MANAGEMENT) */

/** @} */
